Autodesk.Revit.UI.Events.IdlingEventArgs.SetRaiseWithoutDelay
Sets the next invocation of the idling event to be called promptly,
rather than relying on the default recurrence of idling from the Revit application. For more
details see the remarks describing the Idling event.

Autodesk.Revit.UI.Events.IdlingEventArgs
The event arguments used by the Idling event.